# Import Libraries

In [1]:
import pandas as pd
import numpy as np

# Read Dataset

In [2]:
dogs = pd.read_csv('C:/Users/DELL/Explorartory_Data_Analysis/Day 3 (DataFrames & Aggregating Data)/dataset/dogs.csv')

# Explore dataset

In [3]:
dogs.head()

      Name       Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella    Labrador   Brown           56           25     2013-07-01
1  Charlie      Poodle   Black           43           23     2016-09-16
2     Lucy        Chow   Brown           46           22     2014-08-25
3   Cooper   Schnauzer    Gray           49           17     2011-12-11
4      Max    Labrador   Black           59           29     2017-01-20

In [4]:
# check rows and columns

rows, columns = dogs.shape
print(f'There are {rows} rows and {columns} columns in dog dataset')

There are 7 rows and 6 columns in dog dataset

In [5]:
# Get information about dataset

dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            7 non-null      object
 1   Breed           7 non-null      object
 2    Color          7 non-null      object
 3    Height(cm)     7 non-null      int64
 4    Weight(kg)     7 non-null      int64
 5    Date of Birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 464.0+ bytes

There are 6 columns in dataset, from which Name, Breed, Color and Date of Birth columns contains categorical variables and Height and Weight columns contains Numerical Variables. There is no null values in columns

In [6]:
# Get the statistics of numerical columns in dataset

dogs.describe()

        Height(cm)   Weight(kg)
count     7.000000     7.000000
mean     49.714286    27.428571
std      17.960274    22.292429
min      18.000000     2.000000
25%      44.500000    19.500000
50%      49.000000    23.000000
75%      57.500000    27.000000
max      77.000000    74.000000

* The total counts are 7 in height and weight columns


* The mean value of height is 48cm, while the mean value of weight columns 27kg


* The minimum height of dog is 18 cm while the minimum weight of dog is 2 kg, named stella, breed chihuahua, color black


* The maximum height of dog is 77 cm while the maximum weight of dog is 74 kg, named Bernie, breed St. Bernard, color white


* 25% of dogs have height of 44 cm and  weight of 19 kg


* 50 % dogs have height of 49 cm and weight of 23 cm


* 75% dogs have height of 57 cm and weight 27 kg

In [7]:
# Find the columns

dogs.columns

Index(['Name', 'Breed', ' Color', ' Height(cm)', ' Weight(kg)',
       ' Date of Birth'],
      dtype='object')

In [8]:
# Find the values

dogs.values

array([['Bella', ' Labrador', ' Brown', 56, 25, ' 2013-07-01'],
       ['Charlie', ' Poodle', ' Black', 43, 23, ' 2016-09-16'],
       ['Lucy', ' Chow', ' Brown', 46, 22, ' 2014-08-25'],
       ['Cooper', ' Schnauzer', ' Gray', 49, 17, ' 2011-12-11'],
       ['Max', ' Labrador', ' Black', 59, 29, ' 2017-01-20'],
       ['Stella', ' Chihuahua', ' Tan', 18, 2, ' 2015-04-20'],
       ['Bernie', ' St. Bernard', ' White', 77, 74, ' 2018-02-2']],
      dtype=object)

In [9]:
# Find the index 

dogs.index

RangeIndex(start=0, stop=7, step=1)

# Sorting and Subsetting

  # Sorting

In [10]:
dogs

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella      Labrador   Brown           56           25     2013-07-01
1  Charlie        Poodle   Black           43           23     2016-09-16
2     Lucy          Chow   Brown           46           22     2014-08-25
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
4      Max      Labrador   Black           59           29     2017-01-20
5   Stella     Chihuahua     Tan           18            2     2015-04-20
6   Bernie   St. Bernard   White           77           74      2018-02-2

Sort the values by breed and in descending order

In [11]:
dogs.sort_values(by = 'Breed', ascending = False)

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
6   Bernie   St. Bernard   White           77           74      2018-02-2
3   Cooper     Schnauzer    Gray           49           17     2011-12-11
1  Charlie        Poodle   Black           43           23     2016-09-16
0    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
2     Lucy          Chow   Brown           46           22     2014-08-25
5   Stella     Chihuahua     Tan           18            2     2015-04-20

Set the index values to its normal position, by setting ignore_index = True, default value is false

In [12]:
dogs.sort_values(by = 'Breed', ascending = False, ignore_index = True)

      Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0   Bernie   St. Bernard   White           77           74      2018-02-2
1   Cooper     Schnauzer    Gray           49           17     2011-12-11
2  Charlie        Poodle   Black           43           23     2016-09-16
3    Bella      Labrador   Brown           56           25     2013-07-01
4      Max      Labrador   Black           59           29     2017-01-20
5     Lucy          Chow   Brown           46           22     2014-08-25
6   Stella     Chihuahua     Tan           18            2     2015-04-20

# Subsetting

In [13]:
# Get only the Name and breed columns

dogs[['Name', 'Breed']]

      Name         Breed
0    Bella      Labrador
1  Charlie        Poodle
2     Lucy          Chow
3   Cooper     Schnauzer
4      Max      Labrador
5   Stella     Chihuahua
6   Bernie   St. Bernard

In [14]:
# Get the name, breed and color
dogs[['Name', 'Breed', ' Color']]

      Name         Breed   Color
0    Bella      Labrador   Brown
1  Charlie        Poodle   Black
2     Lucy          Chow   Brown
3   Cooper     Schnauzer    Gray
4      Max      Labrador   Black
5   Stella     Chihuahua     Tan
6   Bernie   St. Bernard   White

Get the information about the minimum height dog

In [15]:
dogs[dogs[' Height(cm)'] <  20]

     Name       Breed  Color   Height(cm)   Weight(kg)  Date of Birth
5  Stella   Chihuahua    Tan           18            2     2015-04-20

Get the information about the maximum height dog

In [16]:
dogs[dogs[' Height(cm)'] > 70]

     Name         Breed   Color   Height(cm)   Weight(kg)  Date of Birth
6  Bernie   St. Bernard   White           77           74      2018-02-2

In [17]:
dogs['Breed']

0        Labrador
1          Poodle
2            Chow
3       Schnauzer
4        Labrador
5       Chihuahua
6     St. Bernard
Name: Breed, dtype: object

# Get the Labrador breed dogs

In [18]:
dogs[dogs['Breed'] == ' Labrador']

    Name      Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0  Bella   Labrador   Brown           56           25     2013-07-01
4    Max   Labrador   Black           59           29     2017-01-20

 # Get the black color dogs

In [19]:
dogs[dogs[' Color'] == ' Black']

      Name      Breed   Color   Height(cm)   Weight(kg)  Date of Birth
1  Charlie     Poodle   Black           43           23     2016-09-16
4      Max   Labrador   Black           59           29     2017-01-20

# Get the dog whose breed is Labrador and color is Black

In [20]:
dogs[(dogs['Breed'] == ' Labrador') & (dogs[' Color'] == ' Black')]

  Name      Breed   Color   Height(cm)   Weight(kg)  Date of Birth
4  Max   Labrador   Black           59           29     2017-01-20

# Get the dog whose breed is Labrador or color is Black

In [21]:
dogs[(dogs['Breed'] == ' Labrador') | (dogs[' Color'] == ' Black')]

      Name      Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella   Labrador   Brown           56           25     2013-07-01
1  Charlie     Poodle   Black           43           23     2016-09-16
4      Max   Labrador   Black           59           29     2017-01-20

# Another useful and one line method of filter the dataset by using .isin

# Get the brown and black color dogs

In [22]:
dogs[dogs[' Color'].isin([' Black', ' Brown'])]

      Name      Breed   Color   Height(cm)   Weight(kg)  Date of Birth
0    Bella   Labrador   Brown           56           25     2013-07-01
1  Charlie     Poodle   Black           43           23     2016-09-16
2     Lucy       Chow   Brown           46           22     2014-08-25
4      Max   Labrador   Black           59           29     2017-01-20

In [23]:
dogs['Breed']

0        Labrador
1          Poodle
2            Chow
3       Schnauzer
4        Labrador
5       Chihuahua
6     St. Bernard
Name: Breed, dtype: object

# Get the Chihuahua, Schnauzer, and Poodle Breed Dogs

In [24]:
dogs[dogs['Breed'].isin([' Chihuahua', ' Schnauzer', ' Poodle'])]

      Name       Breed   Color   Height(cm)   Weight(kg)  Date of Birth
1  Charlie      Poodle   Black           43           23     2016-09-16
3   Cooper   Schnauzer    Gray           49           17     2011-12-11
5   Stella   Chihuahua     Tan           18            2     2015-04-20

# Check Dogs health by calculating Dogs BMI

To check dogs health, One way to determine if your dog’s weight is healthy is to calculate your dog’s BMI. It stands for Body Mass Index and is a measure of body fat, calculated based on weight and height.  Knowing your dog’s BMI will tell you if your dog (at their current weight) is considered underweight, normal, overweight, or obese.
 
In metrics unit , formula for calculating is
 
 bmi = weight(kg) / height(m)**2

In [47]:
height_metre = (dogs[' Height(cm)'] / 100) ** 2
height_metre

0    0.3136
1    0.1849
2    0.2116
3    0.2401
4    0.3481
5    0.0324
6    0.5929
Name:  Height(cm), dtype: float64

In [48]:
dogs['BMI'] = (dogs[' Weight(kg)']) / (height_metre)

We have added the new column named BMI in our dogs dataset, which tells us about dogs body mass index, based on dogs height and weight

In [49]:
dogs.sort_values('BMI', ascending = False, ignore_index=True)

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,BMI
0,Bernie,St. Bernard,White,77,74,2018-02-2,124.810255
1,Charlie,Poodle,Black,43,23,2016-09-16,124.391563
2,Lucy,Chow,Brown,46,22,2014-08-25,103.969754
3,Max,Labrador,Black,59,29,2017-01-20,83.309394
4,Bella,Labrador,Brown,56,25,2013-07-01,79.719388
5,Cooper,Schnauzer,Gray,49,17,2011-12-11,70.803832
6,Stella,Chihuahua,Tan,18,2,2015-04-20,61.728395

# Aggregating Data

In [50]:
# Calculate the mean value of BMI

dogs['BMI'].mean()

92.67608290666736

In [52]:
# Calculate mode of BMI
dogs[' Height(cm)'].mode()

0    18
1    43
2    46
3    49
4    56
5    59
6    77
dtype: int64

In [53]:
# calculate minimum value of bmi

dogs['BMI'].min()

61.7283950617284

In [54]:
# Calculate maximum value of bmi
dogs['BMI'].max()

124.81025468038456

In [55]:
# Calculate median of bmi

dogs['BMI'].median()

83.30939385234129

In [56]:
dogs['BMI'].var()

642.9648755571433

In [60]:
dogs['BMI'].std() # Square root of variance is called standard deviation

25.3567520703489

In [57]:
dogs['BMI'].quantile()

83.30939385234129

Default value of quantile is 50% or 0.5, means we get the bmi of dog at 50% quantile and in 2nd quartile

In [59]:
dogs['BMI'].quantile(0.3)   #bmi at 30% quantile

77.93627655143689

# .agg() Method

In [61]:
# create a function to return 30% qunatile

def pct30(column):
    return column.quantile(0.3)

In [62]:
# get the data in 30% quantile of height(cm) column

pct30(dogs[' Height(cm)'])

45.4

In [65]:
pct30(dogs[[' Height(cm)', ' Weight(kg)']])

 Height(cm)    45.4
 Weight(kg)    21.0
Name: 0.3, dtype: float64

In [66]:
dogs[' Height(cm)'].agg(pct30)

45.4

In [67]:
(dogs[[' Height(cm)', ' Weight(kg)']]).agg(pct30)

 Height(cm)    45.4
 Weight(kg)    21.0
dtype: float64

# Calculate Using Lambda Function

In [68]:
dogs['BMI'].agg(lambda x : x.quantile(0.3))

77.93627655143689

By using lambda function, we have eliminate the defininig function part separately, we do it in one line .

In [70]:
dogs[[' Height(cm)', ' Weight(kg)', 'BMI']].agg(lambda x: x.quantile(0.4))  # Calculate 40% quantile

 Height(cm)    47.20000
 Weight(kg)    22.40000
BMI            81.15539
dtype: float64

# cummulative Statistics

In [72]:
dogs[' Height(cm)']

0    56
1    43
2    46
3    49
4    59
5    18
6    77
Name:  Height(cm), dtype: int64

In [71]:
dogs[' Height(cm)'].cumsum()   # it add the cummulatively, by adding the previous value with current value

0     56
1     99
2    145
3    194
4    253
5    271
6    348
Name:  Height(cm), dtype: int64

In [73]:
dogs[' Height(cm)'].cummax()

0    56
1    56
2    56
3    56
4    59
5    59
6    77
Name:  Height(cm), dtype: int64

In [75]:
dogs[' Height(cm)'].cummin()

0    56
1    43
2    43
3    43
4    43
5    18
6    18
Name:  Height(cm), dtype: int64

In [78]:
dogs[' Height(cm)'].cumprod()

0              56
1            2408
2          110768
3         5427632
4       320230288
5      5764145184
6    443839179168
Name:  Height(cm), dtype: int64

# Counting

We Summarize categorical data using counting

In [81]:
dogs

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,BMI
0,Bella,Labrador,Brown,56,25,2013-07-01,79.719388
1,Charlie,Poodle,Black,43,23,2016-09-16,124.391563
2,Lucy,Chow,Brown,46,22,2014-08-25,103.969754
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,70.803832
4,Max,Labrador,Black,59,29,2017-01-20,83.309394
5,Stella,Chihuahua,Tan,18,2,2015-04-20,61.728395
6,Bernie,St. Bernard,White,77,74,2018-02-2,124.810255

In [82]:
dogs.drop_duplicates(subset = 'Breed')

,Name,Breed,Color,Height(cm),Weight(kg),Date of Birth,BMI
0,Bella,Labrador,Brown,56,25,2013-07-01,79.719388
1,Charlie,Poodle,Black,43,23,2016-09-16,124.391563
2,Lucy,Chow,Brown,46,22,2014-08-25,103.969754
3,Cooper,Schnauzer,Gray,49,17,2011-12-11,70.803832
5,Stella,Chihuahua,Tan,18,2,2015-04-20,61.728395
6,Bernie,St. Bernard,White,77,74,2018-02-2,124.810255

It removes the "Labrador" breed, as it is common at index 4, but it disturbs the data integrity because breed type is same, but other parameters are different

# we count the values by using .value_counts() method

In [83]:
dogs['Breed'].value_counts() #be default asscending is False and sort is true

 Labrador       2
 St. Bernard    1
 Schnauzer      1
 Chow           1
 Poodle         1
 Chihuahua      1
Name: Breed, dtype: int64

In [84]:
dogs['Breed'].value_counts(sort = False) # we change the sort parameter, but it disturbs sorting

 St. Bernard    1
 Schnauzer      1
 Chow           1
 Labrador       2
 Poodle         1
 Chihuahua      1
Name: Breed, dtype: int64

In [88]:
dogs['Breed'].value_counts(normalize = True) # Calculate the ratio from 100%, in other words it shows percentage of breeds

 Labrador       0.285714
 St. Bernard    0.142857
 Schnauzer      0.142857
 Chow           0.142857
 Poodle         0.142857
 Chihuahua      0.142857
Name: Breed, dtype: float64

# Grouped Summary Statistics

In [93]:
dogs.groupby('Breed')[' Height(cm)'].min().sort_values()

Breed
 Chihuahua      18
 Poodle         43
 Chow           46
 Schnauzer      49
 Labrador       56
 St. Bernard    77
Name:  Height(cm), dtype: int64

In [94]:
pd.DataFrame(dogs.groupby('Breed')[' Height(cm)'].min().sort_values())

               Height(cm)
Breed
 Chihuahua             18
 Poodle                43
 Chow                  46
 Schnauzer             49
 Labrador              56
 St. Bernard           77

In [95]:
pd.DataFrame(dogs.groupby(['Breed', ' Color'])[' Weight(kg)'].mean())

                      Weight(kg)
Breed         Color
 Chihuahua    Tan              2
 Chow         Brown           22
 Labrador     Black           29
              Brown           25
 Poodle       Black           23
 Schnauzer    Gray            17
 St. Bernard  White           74

# Perform count, min, max, mean, median function by using groupby() and .agg() method

In [97]:
dogs.groupby('Breed')[' Color'].agg('count')

Breed
 Chihuahua      1
 Chow           1
 Labrador       2
 Poodle         1
 Schnauzer      1
 St. Bernard    1
Name:  Color, dtype: int64

# Calculate the min, max, mean and median values of dogs of different breeds

In [103]:
dogs.groupby('Breed')[' Height(cm)'].agg(['min', 'max', 'mean', 'median'])

              min  max  mean  median
Breed
 Chihuahua     18   18  18.0    18.0
 Chow          46   46  46.0    46.0
 Labrador      56   59  57.5    57.5
 Poodle        43   43  43.0    43.0
 Schnauzer     49   49  49.0    49.0
 St. Bernard   77   77  77.0    77.0

# Calculate the min, max, mean and median values of weight and height of different breed dogs

In [112]:
dogs.groupby(['Name', 'Breed'])[' Weight(kg)', ' Height(cm)'].agg(['min', 'max', 'mean', 'median'])

<ipython-input-112-d0a0817e8352>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  dogs.groupby(['Name', 'Breed'])[' Weight(kg)', ' Height(cm)'].agg(['min', 'max', 'mean', 'median'])

                      Weight(kg)                  Height(cm)
                             min max mean median         min max mean median
Name    Breed
Bella    Labrador             25  25   25     25          56  56   56     56
Bernie   St. Bernard          74  74   74     74          77  77   77     77
Charlie  Poodle               23  23   23     23          43  43   43     43
Cooper   Schnauzer            17  17   17     17          49  49   49     49
Lucy     Chow                 22  22   22     22          46  46   46     46
Max      Labrador             29  29   29     29          59  59   59     59
Stella   Chihuahua             2   2    2      2          18  18   18     18

# Pivot Tables

* The "values" argument is the column that you want to summarize/Operation, and the "index" column is the column that you want to group by.


* By default, pivot_table takes the mean value for each group.


* It does the same thing as groupby, but in a more efficient way

In [115]:
# summarize weights of dogs and group by using name and breed

In [114]:
dogs.pivot_table(values = ' Weight(kg)', index = ['Name', 'Breed'])

                       Weight(kg)
Name    Breed
Bella    Labrador              25
Bernie   St. Bernard           74
Charlie  Poodle                23
Cooper   Schnauzer             17
Lucy     Chow                  22
Max      Labrador              29
Stella   Chihuahua              2

In [123]:
dogs.pivot_table(values = ' Weight(kg)', index =  'Breed', aggfunc = np.mean)

               Weight(kg)
Breed
 Chihuahua              2
 Chow                  22
 Labrador              27
 Poodle                23
 Schnauzer             17
 St. Bernard           74

In [124]:
dogs.pivot_table(values = ' Weight(kg)', index = 'Breed', columns = ' Color')

 Color         Black   Brown   Gray   Tan   White
Breed
 Chihuahua       NaN     NaN    NaN   2.0     NaN
 Chow            NaN    22.0    NaN   NaN     NaN
 Labrador       29.0    25.0    NaN   NaN     NaN
 Poodle         23.0     NaN    NaN   NaN     NaN
 Schnauzer       NaN     NaN   17.0   NaN     NaN
 St. Bernard     NaN     NaN    NaN   NaN    74.0

# We fill all the values having Nan values with 0

In [127]:
dogs.pivot_table(values = ' Weight(kg)', index = 'Breed', columns = ' Color', fill_value = 0 )

 Color         Black   Brown   Gray   Tan   White
Breed
 Chihuahua         0       0      0     2       0
 Chow              0      22      0     0       0
 Labrador         29      25      0     0       0
 Poodle           23       0      0     0       0
 Schnauzer         0       0     17     0       0
 St. Bernard       0       0      0     0      74

In [131]:
dogs.pivot_table(values = ' Weight(kg)', index = 'Breed', columns = ' Color', fill_value = 0, margins = True, 
                 margins_name = 'mean')

 Color         Black   Brown   Gray   Tan   White       mean
Breed
 Chihuahua         0     0.0      0     2       0   2.000000
 Chow              0    22.0      0     0       0  22.000000
 Labrador         29    25.0      0     0       0  27.000000
 Poodle           23     0.0      0     0       0  23.000000
 Schnauzer         0     0.0     17     0       0  17.000000
 St. Bernard       0     0.0      0     0      74  74.000000
mean              26    23.5     17     2      74  27.428571